configuration/src/Catalogs/Процессы/Процессы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Процессы</name>
  <comment>Используется для настройки переходов между статусами, как стандартными, так и пользовательскими</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата изменения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата создания</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщий</name>
    <comment>Нужен на первое время, что бы если были ошибки, можно было бы вернуться к старой схеме</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <comment>Тип объекта, к которому относится процесс</comment>
    <type>
      <types>CatalogRef.ТипыОбъектовВладельцев</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияПриПереходах</name>
    <attributes>
      <name>ИдентификаторПерехода</name>
      <comment>Уникальный идентификатор перехода</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <comment>Действие, выполняемое при смене статуса</comment>
      <type>
        <types>CatalogRef.ДействияПриСменеСтатуса</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Пользователь, добавивший переход</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <comment>Дата последнего изменения</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСменыСтатусов</name>
    <attributes>
      <name>ТекущийСтатус</name>
      <comment>Текущий статус задачи</comment>
      <type>
        <types>CatalogRef.СтатусыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>СледующийСтатус</name>
      <comment>Статус, в который доступен переход</comment>
      <type>
        <types>CatalogRef.СтатусыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <comment>Роль пользователя, которой доступно использование перехода</comment>
      <type>
        <types>CatalogRef.РолиУчастников</types>
      </type>
    </attributes>
    <attributes>
      <name>БыстрыйДоступ</name>
      <comment>Определяет, будет ли статус помещен в выпадаюший список</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПерехода</name>
      <comment>Уникальный идентификатор перехода, используется для привязки действий</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Пользователь, добавивший переход</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <comment>Дата последнего изменения</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/НастройкиФилиалов/НастройкиФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиФилиалов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ВидыНастроекФилиалов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор последнего изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <comment>Владелец настройки</comment>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекФилиалов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/ДействияПриСменеСтатуса/ДействияПриСменеСтатуса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДействияПриСменеСтатуса</name>
  <comment>Используется для описания действий, которые будут использоваться при смене статуса</comment>
  <predefined>
    <items>
      <name>ДобавлениеВОчередьТестирования</name>
      <description>Добавление в очередь тестирования</description>
    </items>
    <items>
      <name>ОставитьТекущегоИсполнителя</name>
      <description>Оставить текущего исполнителя</description>
    </items>
    <items>
      <name>СменаИсполнителяНаАвтораЗадачи</name>
      <description>Смена исполнителя на автора задачи</description>
    </items>
    <items>
      <name>СменаИсполнителяНаЗаказчика</name>
      <description>Смена исполнителя на заказчика</description>
    </items>
    <items>
      <name>СменаИсполнителяНаНезаполненноеЗначение</name>
      <description>Смена исполнителя на незаполненное значение</description>
    </items>
    <items>
      <name>СменаИсполнителяНаПоследнегоРазработчика</name>
      <description>Смена исполнителя на последнего разработчика</description>
    </items>
    <items>
      <name>СменаИсполнителяНаПоследнегоРевьюера</name>
      <description>Смена исполнителя на последнего ревьюера</description>
    </items>
    <items>
      <name>СменаИсполнителяНаПоследнегоТестировщика</name>
      <description>Смена исполнителя на последнего тестировщика</description>
    </items>
    <items>
      <name>СменаИсполнителяНаПредыдущегоИсполнителя</name>
      <description>Смена исполнителя на предыдущего исполнителя</description>
    </items>
    <items>
      <name>УдалениеИзОчередиТестирования</name>
      <description>Удаление из очереди тестирования</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидДействия</name>
    <comment>Вид действия</comment>
    <type>
      <types>EnumRef.ВидыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбратноеДействие</name>
    <type>
      <types>CatalogRef.ДействияПриСменеСтатуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипОбъекта</name>
    <comment>Тип объекта, к которому относится данное действие</comment>
    <type>
      <types>CatalogRef.ТипыОбъектовВладельцев</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыОбъектов</name>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>CatalogRef.ТипыОбъектовВладельцев</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбъектов</name>
  <comment>Хранит  элементы, соответствующие определенным статусам объектов.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>DesignReview</name>
      <description>Design review</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВРеализацию</name>
      <description>В реализацию</description>
    </items>
    <items>
      <name>Внедрение</name>
      <description>Внедрение</description>
    </items>
    <items>
      <name>ВнутреннееТестирование</name>
      <description>Внутреннее тестирование</description>
    </items>
    <items>
      <name>Документирование</name>
      <description>Документирование</description>
    </items>
    <items>
      <name>ЗапросТребований</name>
      <description>Запрос требований</description>
    </items>
    <items>
      <name>Масштабирование</name>
      <description>Масштабирование</description>
    </items>
    <items>
      <name>НаДоработку</name>
      <description>На доработку</description>
    </items>
    <items>
      <name>Рассмотрение</name>
      <description>На рассмотрении</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Отложен</name>
      <description>Отложен</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Проработка</name>
      <description>Проработка</description>
    </items>
    <items>
      <name>Протестирован</name>
      <description>Протестирован</description>
    </items>
    <items>
      <name>Публикация</name>
      <description>Публикация</description>
    </items>
    <items>
      <name>Рассмотрен</name>
      <description>Рассмотрен</description>
    </items>
    <items>
      <name>РевьюТребований</name>
      <description>Ревью требований</description>
    </items>
    <items>
      <name>Решен</name>
      <description>Решен</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЗафиксирован</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс изображения в общей картинке СтатусыОбъектов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядковый номер статуса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныИзмененияСтатуса</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныИзмененияСтатусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ТипыОбъектовВладельцев/ТипыОбъектовВладельцев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОбъектовВладельцев</name>
  <comment>Хранит предопределенные элементы, которые соответствуют определенным объектам конфигурации</comment>
  <predefined>
    <items>
      <name>Документ_ВнутреннееЗадание</name>
      <description>Документ &quot;Внутреннее задание&quot;</description>
    </items>
    <items>
      <name>Документ_Задача</name>
      <description>Документ &quot;Задача&quot;</description>
    </items>
    <items>
      <name>Документ_ЗаявкаНаРазработку</name>
      <description>Документ &quot;Заявка на разработку&quot;</description>
    </items>
    <items>
      <name>Справочник_Проекты</name>
      <description>Справочник &quot;Проекты&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекФилиалов</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/Процессы/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет обработчики обновления
//
// Параметры:
//  Обработчики	 - ТаблицаЗначений	 - см. ПриложениеВызовСервера.ПолучитьОбработчикиДанных
//
Процедура ДобавлениеОбработчиковОбновления(Обработчики) Экспорт     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.Процессы.ПроверитьПредопределенныеЭлементы";
	
КонецПроцедуры

// Возвращает используемый процесс для филиала
//
// Параметры:
//  Филиал		 - СправочникСсылка.Филиалы	 - ссылка на филиал
//  ТипОбъекта	 - СправочникСсылка.ТипыОбъектовВладельцев - тип объекта владельца
// 
// Возвращаемое значение:
//  Справочникссылка.Процессы - используемый процесс для филиала
//
Функция ИспользуемыйПроцессФилиала(Знач Филиал, Знач ТипОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиФилиалов.Значение КАК Процесс
	|ИЗ
	|	Справочник.Филиалы КАК Филиалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФилиалов КАК НастройкиФилиалов
	|		ПО (НастройкиФилиалов.Филиал = Филиалы.Ссылка)
	|			И (НастройкиФилиалов.Настройка = &Настройка)
	|			И (НЕ НастройкиФилиалов.Значение = ЗНАЧЕНИЕ(Справочник.Процессы.ПустаяСсылка))
	|			И (Филиалы.Ссылка = &Филиал)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Процессы.Ссылка
	|ИЗ
	|	Справочник.Процессы КАК Процессы
	|ГДЕ
	|	Процессы.Филиал = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка)
	|	И Процессы.ТипОбъекта = &ТипОбъекта
	|	И Процессы.ИспользоватьОбщий";
	
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);  
	Запрос.УстановитьПараметр("Настройка", ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТипОбъекта, "Настройка"));  
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = Неопределено;
	
	Если  НЕ РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Процесс;  
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает действие смены исполнителя
//
// Параметры:
//  ТипОбъекта		 - СправочникСсылка.ТипыОбъектовВладельцев	 - тип объекта
//  ДанныеОбъекта	 - Структура	 - заполненная структура данных объекта: Филиал, СтарыйСтатус, НовыйСтатус
// 
// Возвращаемое значение:
//  СправочникСсылка.ДействияПриСменеСтатуса, Неопределено - ссылка на действие или Неопределено в случае отсутствия
//
Функция ПолучитьДействияСменыСтатуса(Знач ТипОбъекта, Знач ДанныеОбъекта, ВидДействия) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДействияПриПереходахПроцесса.Действие КАК Действие
	|ИЗ
	|	Справочник.Процессы КАК Процессы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Процессы.НастройкиСменыСтатусов КАК НастройкиСменыСтатусовПроцесса
	|		ПО Процессы.Ссылка = НастройкиСменыСтатусовПроцесса.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Процессы.ДействияПриПереходах КАК ДействияПриПереходахПроцесса
	|		ПО (НастройкиСменыСтатусовПроцесса.Ссылка = ДействияПриПереходахПроцесса.Ссылка)
	|			И (НастройкиСменыСтатусовПроцесса.ИдентификаторПерехода = ДействияПриПереходахПроцесса.ИдентификаторПерехода)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДействияПриСменеСтатуса КАК ДействияПриСменеСтатуса
	|		ПО (ДействияПриПереходахПроцесса.Действие = ДействияПриСменеСтатуса.Ссылка)
	|ГДЕ
	|	Процессы.Ссылка = &Процесс
	|	И Процессы.ТипОбъекта = &ТипОбъекта
	|	И НастройкиСменыСтатусовПроцесса.ТекущийСтатус = &СтарыйСтатус
	|	И НастройкиСменыСтатусовПроцесса.СледующийСтатус = &НовыйСтатус
	|	И ДействияПриСменеСтатуса.ВидДействия = &ВидДействия";
	
	
	Запрос.УстановитьПараметр("ВидДействия", ВидДействия);
	Запрос.УстановитьПараметр("Процесс", ИспользуемыйПроцессФилиала(ДанныеОбъекта.Филиал, ТипОбъекта));
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("СтарыйСтатус", ДанныеОбъекта.СтарыйСтатус);
	Запрос.УстановитьПараметр("НовыйСтатус", ДанныеОбъекта.НовыйСтатус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.Действие;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует список статусов для типа объекта, в которые возможен переход согласно процессу филиала
//
// Параметры:
//  Процесс	 - СправочникСсылка.Процессы	 - процесс
//  ТипОбъекта	 - СправочникСсылка.ТипыОбъектовВладельцев	 - тип объекта, к которому относится статус
//  ВернутьСписокЗначений	 - Булево	 - если Истина - вернет список значений, если Ложь - массив ссылок
// 
// Возвращаемое значение:
//  СписокЗначений, Массив - набор статусов процесса филиала
//
Функция ПолучитьСтатусыПроцессаФилиала(Знач Процесс, Знач ТипОбъекта, Знач ВернутьСписокЗначений = Истина) Экспорт
	
	Если ВернутьСписокЗначений Тогда
		Результат = Новый СписокЗначений;
	Иначе
		Результат = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроцессыНастройкиСменыСтатусов.ТекущийСтатус КАК Ссылка,
	|	СтатусыОбъектов.Наименование КАК Наименование,
	|	СтатусыОбъектов.ИмяКартинкиВБиблиотеке КАК ИмяКартинки,
	|	СтатусыОбъектов.Порядок КАК Порядок
	|ИЗ
	|	Справочник.Процессы КАК Процессы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Процессы.НастройкиСменыСтатусов КАК ПроцессыНастройкиСменыСтатусов
	|		ПО Процессы.Ссылка = ПроцессыНастройкиСменыСтатусов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|		ПО (ПроцессыНастройкиСменыСтатусов.ТекущийСтатус = СтатусыОбъектов.Ссылка)
	|ГДЕ
	|	Процессы.Ссылка = &Процесс
	|	И Процессы.ТипОбъекта = &ТипОбъекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыОбъектов.Порядок";
	
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ВернутьСписокЗначений Тогда
				ИмяКартинки = СтрШаблон("Статус%1", Выборка.ИмяКартинки);
				
				НовыйЭлемент = Результат.Добавить();
				НовыйЭлемент.Значение = Выборка.Ссылка;
				НовыйЭлемент.Представление = Выборка.Наименование;
				НовыйЭлемент.Картинка = БиблиотекаКартинок[ИмяКартинки];
			Иначе
				Результат.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет предопределенные настройки
//
Процедура ПроверитьПредопределенныеЭлементы() Экспорт 
	
	ЗаполнитьПроцессДляЗадачи();
	ЗаполнитьПроцессДляВнутреннегоЗадания();                                 	
	
КонецПроцедуры     

//////////////////////////////////////////
// ИСТОРИЯ ИЗМЕНЕНИЙ ОБЪЕКТА

// Возвращает структуру проверяемых данных
// 
// Возвращаемое значение:
//   - Структура
//		* Реквизиты	 - Массив	 - названия реквизитов которые требуют проверки
//		* ТабличныеЧасти	 - Структура	 - табличные части и их реквизиты которые требуют проверки.
//			Ключ - название табличной части
//			Значение - реквизит табличной части который требуется проверить
//
Функция ПроверяемыеСвойстваОбъекта() Экспорт
	
	Результат = Новый Структура("Реквизиты, ТабличныеЧасти", Новый Массив, Новый Структура);
	
	ПоляТабличнойЧасти = Новый Массив;
	ПоляТабличнойЧасти.Добавить("ТекущийСтатус");
	ПоляТабличнойЧасти.Добавить("СледующийСтатус");
	
	ДанныеТабличнойЧасти = Новый Структура;
	ДанныеТабличнойЧасти.Вставить("Поля", ПоляТабличнойЧасти);
	ДанныеТабличнойЧасти.Вставить("КлючевоеПоле", "ТекущийСтатус");
	
	Результат.ТабличныеЧасти.Вставить("НастройкиСменыСтатусов", ДанныеТабличнойЧасти);

	ПоляТабличнойЧасти = Новый Массив;
	ПоляТабличнойЧасти.Добавить("Метрика");
	ПоляТабличнойЧасти.Добавить("СтатусНачало");
	ПоляТабличнойЧасти.Добавить("СтатусКонец");
	
	ДанныеТабличнойЧасти = Новый Структура;
	ДанныеТабличнойЧасти.Вставить("Поля", ПоляТабличнойЧасти);
	ДанныеТабличнойЧасти.Вставить("КлючевоеПоле", "Метрика");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПроцессДляЗадачи()        
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Процессы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Процессы КАК Процессы
	|ГДЕ
	|	Процессы.Филиал = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка)
	|	И Процессы.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.ТипыОбъектовВладельцев.Документ_Задача)";  
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда  
		НовыйПроцесс = Справочники.Процессы.СоздатьЭлемент();
		НовыйПроцесс.Наименование = "Общий процесс";
		НовыйПроцесс.ИспользоватьОбщий = Истина;
		НовыйПроцесс.ТипОбъекта = Справочники.ТипыОбъектовВладельцев.Документ_Задача; 
		
		НастройкиСмены = НовыйПроцесс.НастройкиСменыСтатусов;
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Новый, Справочники.СтатусыОбъектов.ВРаботе);
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Новый, Справочники.СтатусыОбъектов.ВРеализацию);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Новый, Справочники.СтатусыОбъектов.Рассмотрение);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Новый, Справочники.СтатусыОбъектов.Отклонен);
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Новый, Справочники.СтатусыОбъектов.Решен);
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Рассмотрение, Справочники.СтатусыОбъектов.ВРеализацию);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Рассмотрение, Справочники.СтатусыОбъектов.НаДоработку);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Рассмотрение, Справочники.СтатусыОбъектов.Отклонен);		
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.НаДоработку, Справочники.СтатусыОбъектов.Рассмотрение);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.НаДоработку, Справочники.СтатусыОбъектов.Новый);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.НаДоработку, Справочники.СтатусыОбъектов.Отклонен);		
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРеализацию, Справочники.СтатусыОбъектов.ВРаботе);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРеализацию, Справочники.СтатусыОбъектов.Отклонен);		
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРаботе, Справочники.СтатусыОбъектов.Публикация);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРаботе, Справочники.СтатусыОбъектов.CodeReview);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРаботе, Справочники.СтатусыОбъектов.Отклонен);	
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРаботе, Справочники.СтатусыОбъектов.Приостановлен);	
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРаботе, Справочники.СтатусыОбъектов.Тестирование);	
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Публикация, Справочники.СтатусыОбъектов.CodeReview);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Публикация, Справочники.СтатусыОбъектов.ВРаботе);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Публикация, Справочники.СтатусыОбъектов.Тестирование);		
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Приостановлен, Справочники.СтатусыОбъектов.Отклонен);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Приостановлен, Справочники.СтатусыОбъектов.ВРаботе);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Приостановлен, Справочники.СтатусыОбъектов.Тестирование);		
	
        ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Тестирование, Справочники.СтатусыОбъектов.Публикация);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Тестирование, Справочники.СтатусыОбъектов.CodeReview);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Тестирование, Справочники.СтатусыОбъектов.ВРаботе);		
	    ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Тестирование, Справочники.СтатусыОбъектов.Приостановлен);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Тестирование, Справочники.СтатусыОбъектов.Протестирован);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Тестирование, Справочники.СтатусыОбъектов.Тестирование);		
	    ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Тестирование, Справочники.СтатусыОбъектов.Решен);		
		
        ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Протестирован, Справочники.СтатусыОбъектов.Публикация);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Протестирован, Справочники.СтатусыОбъектов.Решен);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Протестирован, Справочники.СтатусыОбъектов.ВРаботе);		
	    ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Протестирован, Справочники.СтатусыОбъектов.Тестирование);		
		
        ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.CodeReview, Справочники.СтатусыОбъектов.Публикация);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.CodeReview, Справочники.СтатусыОбъектов.Тестирование);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.CodeReview, Справочники.СтатусыОбъектов.ВРаботе);
		
		НовыйПроцесс.Записать();
	КонецЕсли;
	
КонецПроцедуры 

Процедура ЗаполнитьПроцессДляВнутреннегоЗадания()        
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Процессы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Процессы КАК Процессы
	|ГДЕ
	|	Процессы.Филиал = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка)
	|	И Процессы.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.ТипыОбъектовВладельцев.Документ_ВнутреннееЗадание)";  
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда  
		НовыйПроцесс = Справочники.Процессы.СоздатьЭлемент();
		НовыйПроцесс.Наименование = "Общий процесс";
		НовыйПроцесс.ИспользоватьОбщий = Истина;
		НовыйПроцесс.ТипОбъекта = Справочники.ТипыОбъектовВладельцев.Документ_ВнутреннееЗадание; 
		
		НастройкиСмены = НовыйПроцесс.НастройкиСменыСтатусов;
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Новый, Справочники.СтатусыОбъектов.ВРаботе);
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Новый, Справочники.СтатусыОбъектов.Отклонен);
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРаботе, Справочники.СтатусыОбъектов.Решен);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРаботе, Справочники.СтатусыОбъектов.Приостановлен);	
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.ВРаботе, Справочники.СтатусыОбъектов.Тестирование);	
		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Приостановлен, Справочники.СтатусыОбъектов.Отклонен);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Приостановлен, Справочники.СтатусыОбъектов.ВРаботе);		
		ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Приостановлен, Справочники.СтатусыОбъектов.Решен);		
	
        ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Тестирование, Справочники.СтатусыОбъектов.ВРаботе);		
	    ДобавитьСтрокуСменыСтатусов(НастройкиСмены, Справочники.СтатусыОбъектов.Тестирование, Справочники.СтатусыОбъектов.Решен);		
		
		НовыйПроцесс.Записать();
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьСтрокуСменыСтатусов(НастройкиСменыСтатусов, Текущий, Следующий)
	
	НоваяСтрока = НастройкиСменыСтатусов.Добавить();
	НоваяСтрока.ТекущийСтатус = Текущий;
	НоваяСтрока.СледующийСтатус = Следующий;
	НоваяСтрока.БыстрыйДоступ = Истина;
	НоваяСтрока.ИдентификаторПерехода = Новый УникальныйИдентификатор;
	НоваяСтрока.Роль = Справочники.РолиУчастников.ВсеРоли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
